{"keras_version": "2.1.1", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_shape": null, "mode_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "trainable": true, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "name": "embedding_6", "input_length": null, "embeddings_constraint": null, "output_dim": 256, "input_dim": 20000, "mask_zero": false, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"units": 128, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_6", "go_backwards": false, "bias_constraint": null, "return_state": false, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.6, "name": "dropout_5", "noise_shape": null, "trainable": true, "seed": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "trainable": true, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "name": "embedding_7", "input_length": null, "embeddings_constraint": null, "output_dim": 256, "input_dim": 20000, "mask_zero": false, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"units": 128, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_7", "go_backwards": false, "bias_constraint": null, "return_state": false, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.6, "name": "dropout_6", "noise_shape": null, "trainable": true, "seed": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "trainable": true, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "name": "embedding_8", "input_length": null, "embeddings_constraint": null, "output_dim": 256, "input_dim": 20000, "mask_zero": false, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"units": 128, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_8", "go_backwards": false, "bias_constraint": null, "return_state": false, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.6, "name": "dropout_7", "noise_shape": null, "trainable": true, "seed": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "trainable": true, "batch_input_shape": [null, null], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "name": "embedding_9", "input_length": null, "embeddings_constraint": null, "output_dim": 256, "input_dim": 20000, "mask_zero": false, "activity_regularizer": null, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"units": 128, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_9", "go_backwards": false, "bias_constraint": null, "return_state": false, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "tanh", "recurrent_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.6, "name": "dropout_8", "noise_shape": null, "trainable": true, "seed": null}}]}], "concat_axis": -1, "output_mask": null, "output_mask_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "name": "merge_2", "arguments": {}, "mode": "concat"}}, {"class_name": "LSTM", "config": {"units": 256, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "name": "lstm_10", "go_backwards": false, "kernel_regularizer": null, "return_state": false, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_dropout": 0.0, "dropout": 0.0, "use_bias": true, "stateful": false, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unroll": false, "activity_regularizer": null, "activation": "tanh", "return_sequences": false}}, {"class_name": "Dense", "config": {"units": 1, "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "activation": "sigmoid"}}]}